# AssetPropertyDoubleArray4d Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetPropertyDoubleArray4d Class
Members See Also
---
Represents a color property of material.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class AssetPropertyDoubleArray4d : AssetProperty
```

Visual Basic
---
```text
Public Class AssetPropertyDoubleArray4d _
	Inherits AssetProperty
```

Visual C++
---
```text
public ref class AssetPropertyDoubleArray4d : public AssetProperty
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Visual..::..AssetProperty Autodesk.Revit.DB.Visual..::..AssetPropertyDoubleArray4d
# See Also
AssetPropertyDoubleArray4d Members
Autodesk.Revit.DB.Visual Namespace